In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Store CSV int DataFrame

In [22]:
mls_2007 = "Resources/mlssalaries2007.csv"
mls_07_data =pd.read_csv(mls_2007)
mls_07_data.head()

  club last_name  first_name position  base_salary  guaranteed_compensation
0  CHI     Armas       Chris        M     225000.0                 225000.0
1  CHI    Banner     Michael        M      12900.0                  12900.0
2  CHI   Barrett        Chad        F      41212.5                  48712.5
3  CHI    Blanco  Cuauhtemoc        F    2492316.0                2666778.0
4  CHI     Brown        C.J.        D     106391.0                 106391.0

In [23]:
mls_2009 = "Resources/mlssalaries2009.csv"
mls_09_data = pd.read_csv(mls_2009)
mls_09_data.head()

  club  last_name first_name position  base_salary  guaranteed_compensation
0   NE   Albright      Chris        D     176000.0                 176000.0
1  RSL  Alexandre       Jean        M      34000.0                  34000.0
2   DC      Allen        Ely      F-M      15300.0                  15300.0
3  SEA     Alonso    Osvaldo        M      65000.0                  65000.0
4   NE     Alston      Kevin        D      55000.0                 104000.0

In [24]:
# Observe the missing data
null_data = mls_07_data[mls_07_data.isnull().any(axis=1)]
null_data

Empty DataFrame
Columns: [club, last_name, first_name, position, base_salary, guaranteed_compensation]
Index: []

In [25]:
# Observe the missing data
null_data = mls_09_data[mls_09_data.isnull().any(axis=1)]
null_data

Empty DataFrame
Columns: [club, last_name, first_name, position, base_salary, guaranteed_compensation]
Index: []

In [26]:
# Check the count
mls_09_data.count()

club                       388
last_name                  388
first_name                 388
position                   388
base_salary                388
guaranteed_compensation    388
dtype: int64

In [27]:
# Check the count
mls_07_data.count()

club                       371
last_name                  371
first_name                 371
position                   371
base_salary                371
guaranteed_compensation    371
dtype: int64

In [28]:
# Find duplicate team names
mls_07_data['club'].unique()

array(['CHI', 'CHV', 'CLB', 'COL', 'DAL', 'DC', 'HOU', 'KC', 'LA', 'NE',
       'NY', 'Pool', 'RSL', 'TFC'], dtype=object)

In [29]:
mls_09_data['club'].unique()

array(['NE', 'RSL', 'DC', 'SEA', 'SJ', 'NY', 'KC', 'HOU', 'TFC', 'DAL',
       'COL', 'CHI', 'LA', 'Pool', 'CHV', 'CLB'], dtype=object)

## Difference in Salary from 2007 to 2009

In [ ]:
# For that, compute the average salary

## Connect to local Database

In [ ]:
#"<insert user name>:<insert password>@localhost:5432/customer_db"
rds_connection_string = "postgres:112524@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')